Repository: DaoNik/angular-books-market
Catalog: src/i18n/messages.*.xlf
Languages: ru

# welcome
source: Hello world!
ru: Всем привет!

source: /en-US/portfolio
ru: /ru/portfolio

source: My portfolio
ru: Моё портфолио

source: Portfolio
ru: Портфолио

source: {VAR_PLURAL, plural, zero {no tasks} one {{INTERPOLATION} task} few {{INTERPOLATION} tasks} many {{INTERPOLATION} tasks} other {{INTERPOLATION} tasks}}
ru: {VAR_PLURAL, plural, zero {нет заданий} one {{INTERPOLATION} task} few {{INTERPOLATION} задания} many {{INTERPOLATION} заданий} other {{INTERPOLATION} задания}}

source: Gender: {genderCode, select, 0 {male} 1 {female} other {unknown}}
ru: Пол: {genderCode, select, 0 {male} 1 {female} other {unknown}}

source: {VAR_SELECT, select, 0 {male} 1 {female} other {unknown}}
ru: {VAR_SELECT, select, 0 {мужчина} 1 {женщина} other {другой}}

source: Male
ru: Мужчина

source: Female
ru: Женщина

source: Other
ru: Другой

source: Copyright 2022
ru: Права защищены 2022

source: Created by {PH}
ru: Создано {PH}
